{"data":{"markdownRemark":{"html":"<h1>Opção cleaner</h1>\n<blockquote>\n<p>Removedor de acentos.</p>\n</blockquote>\n<ul>\n<li>Tipo: <em>Function</em>.</li>\n<li>Valor padrão: <a href=\"https://npm.im/diacritics\"><code>diacritics</code></a>.</li>\n</ul>\n<p>Isso deve ser uma função que faz a remoção de acentos nos caracteres da <em>string</em> antes de filtrá-la, por padrão é usado o função do módulo <a href=\"https://npm.im/diacritics\"><code>diacritics</code></a> que é uma das mais completas funções para normalização desses caracteres. É necessário fazer a remoção de acentos, para padronizar a criação de filtros, para impedir que um filtro seja burlado e principalmente para evitar que seja filtrado trechos indesejáveis dentro da <em>string</em>.</p>\n<h2>Exemplo</h2>\n<pre><code class=\"language-js\">const Piii = require(\"piii\");\nconst piiiFilters = require(\"piii-filters\");\n\n/**\n * Desacentuador personalizado.\n */\nconst removeAccents = string => string\n  .replace(/ô/g, \"o\")\n  .replace(/ê/g, \"e\");\n\nconst piii = new Piii({\n  filters: [\n    piiiFilters.cu,\n    piiiFilters.foder\n   ],\n  cleaner: removeAccents\n});\n\npiii.filter(\"Vá se fôdêr!\"); // \"Vá se *!\"\npiii.filter(\"Vá tomar no cú!\"); // \"Vá tomar no cú!\"\n</code></pre>\n<p>Observe que no último exemplo (de <code>Vá tomar cú!</code>) o palavrão <em>cú</em> não foi filtrado, pois o desacentuador personalizado (definido em <code>removeAccents</code>) não fez a remoção do acento agudo na letra <em>U</em>.</p>\n<h2>Problemas com o não-uso de um desacentuador</h2>\n<p>O <em>Piii.js</em> para filtrar somente uma palavra usa o metacaractere <code>\\b</code> (nas expressões regulares) evintando assim que seja filtrado partes de DENTRO de outras palavras, por exemplo, para que um filtro do palavrão <em>cu</em> não filtre <em>piraru<strong>cu</strong></em> ou <em><strong>cu</strong>rrí<strong>cu</strong>lo</em>. Se não for usado um desacentuador, um problema ocorrerá, porquê o metacactere <code>\\b</code> não interpreta uma palavra quando ela termina ou começa com um caractere acentudado, por exemplo, a expressão regular <code>\\bcú\\b</code> (terminada com <em>ú</em>) não corresponde a nada na <em>string</em> <em>Vai tomar no cú!</em>. Por esses motivos é usado um removedor de acentos que irá remover todos os acentos da <em>string</em>, fazer a filtragem dos palavrões e posteriormente devolver todos os acentos da letras que não foram filtradas.</p>","frontmatter":{"path":"/docs/options/cleaner","title":"Opção cleaner"}}},"pageContext":{}}